Repository: massidea/site
Catalog: application/languages/index.tmx
Source language: fi
Languages: en

source: Käyttöehdot
en: Terms

source: Yksityisyys
en: Privacy

source: Näytä lisää
en: Show more

source: Massidea.org on myös open source-projekti. Liity kehitystiimiin.
en: Massidea.org is also an open source project. Join the development team.

source: käyttäjät
en: Users

source: Ryhmät ja kampanjat
en: Groups and campaigns

source: Aktiivisimmat
en: Most active

source: Näytä kaikki
en: Show all

source: Rekisteröidy!
en: Sign up now!

source: tagit
en: tags

source: Suosituimmat
en: Most popular

source: Uusimmat sisällöt
en: Recent posts

source: Lue lisää
en: Learn more

source: Mikä on Massidea.org?
en: What is Massidea.org?

source: Massidea.org on ilmainen ja avoin innovaatioyhteisö, jonka jäsenet lisäävät ideoitaan, tulevaisuuden visioitaan ja tämän päivän haasteita sekä linkittävät niitä toisten käyttäjien vastaaviin. Sekoituksen lopputulos voimistaa yksilön luomiskykyä ja auttaa mahtavan idean synnyssä. Lue lisää
en: Massidea.org is an open innovation community for sharing challenges, ideas and visions. It boosts individual and communal creativity by intelligently connectiong people and their insights. Massidea.org is free open source solution and it is publicly available for use and modifications. Learn more from our blog.

source: Tulevaisuuden näkymät
en: Visions of the future

source: Tämän päivän haasteet
en: Today's challenges

source: Ideat
en: View ideas

source: Haaste
en: Challenge

source: Näkymä
en: Vision

source: Etusivu
en: Home

source: Haku
en: Search

source: Kirjaudu
en: Login

source: tai
en: or

source: Rekisteröidy
en: Sign up

source: Käyttäjänimi
en: Username

source: Salasana
en: Password

source: Lisää sisältöä
en: Add content

source: Käyttäjätilini
en: My account

source: Kirjaudu ulos
en: Logout

source: Kirjautuneena
en: Logged in

source: Käyttäjät
en: Users

source: Apua
en: Help

source: Tietoja
en: About

source: Yhteystiedot
en: Contact

source: Työpaikat
en: Jobs

source: Kehittäminen
en: Development

source: Tätä projektia rahoittaa
en: This project is funded by

source: Projektin koordinaattori
en: Project coordinator

source: Projektiryhmä
en: Project group

source: Tervetuloa innovointiyhteisöön! Avoin ideapankki – Open Innovation Banking System (OIBS) – on kaikille avoin yhteisöllinen innovaatiopalvelu. Yhteisössä vaihdetaan ja kehitetään uusia ideoita, ratkaisuja ja osaamista. OIBS-yhteisö tuottaa ideoita tämän päivän ongelmiin ja tulevaisuuden näkymiin. Yhdessä tämän päivän haasteet, tulevaisuuden näkymät ja niihin tarjotut ratkaisut muodostavat kolme "tietopankkia". OIBS-järjestelmän ajatuksena on pyrkiä pitämään ongelma, nykytieto ja tulevaisuustieto erillisissä tietopankeissa ja näiden osioiden tietoja yhdistelemällä saamaan aikaiseksi mahdollisimman kiinnostavia ja uusia ajatuksia.
en: Welcome to the innovation community! The Open Innovation Banking System (OIBS) is a public, open and communal innovation service available to anyone, anywhere. In the OIBS network, users can exchange and develop ideas, solutions and know-how. The OIBS network produces new ideas and solutions for the present challenges and future scenarios. Together the present challenges, visions of the future and the ideas form three separate "information repositories". The main idea of OIBS is to form new interesting ideas and solutions by combining the information in the three repositories.

source: Kuka tahansa voi maksutta rekisteröityä OIBS:n käyttäjäksi ja liittyä yhteisöön. Rekisteröityneet käyttäjät voivat: lisätä OIBS-tietokantaan kuvauksia tämän päivän ongelmista tai tulevaisuuden näkymistä esittää ideoita tietokannasta löytyviin ongelmiin ja tulevaisuuden visioihin arvostella ja kommentoida muiden käyttäjien tuotoksia kehittää tietokannasta jo löytyviä ideoita luoda kilpailevia ideoita luoda oman profiilin.
en: Register for free and join the OIBS network. Registered users can: Add descriptions of the problems or visions into the database Solve the current problems and visions of the future found in the database Rate and comment the content added by other users Further develop and challenge the ideas of other users Create their own profile

source: OIBS opiskelijoille Paikka ideoiden julkaisulle, kehittämiselle ja kansainväliselle menestykselle OIBS:ssa opiskelijat voivat esittää uusia ideoitaan, saada niihin palautetta, uusia näkökulmia ja paranteluehdotuksia. OIBS:n ainutlaatuisen verkoston kautta opiskelija voi jatkojalostaa ideaansa kenties kaupalliseksi innovaatioksi asti. Ideat julkaistaan kansainvälisesti. Korkeakoulujen opetus- ja oppimistyökalu Kurssitehtäviä, kokonaisia opintojaksoja, hankkeita sekä projektitöitä tehdään OIBS:n välityksellä. Palvelun osaaminen edistää opintoja. OIBS:ia käyttämällä voi oppia, miten uusia innovaatioita luodaan. Innovaatioiden kehittäminen on myös tehokas oppimiskeino. Avaa ovia työmaailmaan Opiskelijat voivat tehdä yhteistyötä yritysten kanssa ja luoda uusia kontakteja työmaailmaan. OIBS-käyttäjän profiili toimii eräänlaisena käyntikorttina. Profiili kertoo, minkälaisissa hankkeissa käyttäjä on ollut mukana, mitä ideoita ja aineistoa hän on tuottanut.
en: OIBS For the student Students can present their new ideas while receiving feedback, finding new perspectives and getting tips for further improving their ideas With the help of the unique OIBS network, a student may process his or her idea – perhaps all the way to a commercial innovation. Ideas are published internationally. OIBS is a new kind of a learning tool. Course assignments and projects are being conducted via OIBS. Knowing how to use the service will further the studies. By using the OIBS one can learn how new innovations are being created. Developing innovations is also an efficient way to learn. OIBS opens doors to the working life Students can do co-operation with companies and create new contacts to the work life The OIBS user profile functions as a sort of a business card. The profile shows, what types of projects the user has been involved in and what ideas and content he or she has produced. The profile tells directly about your innovativeness.

source: OIBS opettajille Opettajat voivat käyttää OIBS:ia opetustyökaluna. OIBS:n kautta opiskelijaryhmien tuotoksien ja edistymisen seuraaminen on helppoa. Opettajat voivat osallistua OIBS-verkkopalvelun kehittämiseen ja sisällöntuotannon organisointiin. Opettajat voivat olla yhteydessä yritysmaailmaan sekä muiden maiden kouluihin ja niiden innovatiiviseen toimintaan.
en: OIBS For instructors Instructors use OIBS as a teaching tool. Via OIBS the results and progression of the student groups are easy to follow The teachers can participate in the OIBS service development and organizing the content production The teachers can create contacts with companies, schools and innovation activities internationally

source: OIBS aktiivisille eläkeläisille Eläkeläisten osaaminen ja elämänkokemus on arvokasta. OIBS tarjoaa paikan, jossa kokemukset ja osaamisen voi jakaa muille. OIBS:n kautta vanhojen ja nuorten luovuus voi yhdistyä. OIBS:n kautta eläkeläiset voivat olla aktiivisesti mukana kehittämässä ratkaisuja ja ideoita, jotka auttavat edistämään heidän hyvinvointiaan ja kehittämään palveluja sekä toimintaa. Eläkeläinen voi halutessaan säilyttää yhteyden toimialaansa työuran päätyttyä. Ihmiset voivat työuransa jälkeenkin olla halutessaan kehittämässä työmaailmaansa liittyviä haasteita ja ongelmia ja siten hyödyttää yritysmaailmaa omalla kokemuksellaan.
en: OIBS for active pensioners The know-how and experience of the senior citizens is valuable. The OIBS offers a place, where this experience and knowledge can be shared with others With the help of the OIBS, the pensioners can actively be involved in developing solutions and ideas, which for instance will help further their own well-being and develop different services and activities Through OIBS, pensioners can stay in contact with their industry and their areas of specialization. Even after their career people can be involved in solving the challenges and problems related to their area of specialization

source: OIBS yrityksille Yritykset voivat hyödyntää OIBS:ssa tuotettuja innovaatioita omiin tarpeisiinsa OIBS:ssa on saatavilla tietoa asiakkaan ongelmista (tarpeista, haluista), nykyisestä markkinoiden kehityksestä sekä tulevaisuuden näkymistä. Yritykset voivat tallentaa OIBS:iin kuvauksia markkinoidensa ongelmista ja saada uusia näkökulmia ja ratkaisuja kustannustehokkaasti OIBS vähentää yrityksen sisäistä ideointityön tarvetta Yritykset voivat löytää uutta innovatiivista työvoimaa OIBS:n kautta Vanhat, kokeneet työntekijät ja heidän osaamisensa ovat arvokasta pääomaa yrityksille ja organisaatioille. OIBS:n kautta eläkkeelle jääneiden työntekijöiden luovuutta ja osaamista voidaan edelleen hyödyntää OIBS:lla on tärkeä teknologinen ja sosiaalinen rooli uusien ideoiden ja keksintöjen kaupallistamisessa.
en: OIBS for companies Companies can utilize the innovations produced by OIBS network In OIBS a company can find information on the problems (needs, desires) of the customer, on the current development of the markets as well as on the future outlooks Companies can add descriptions of their problems to the OIBS and find new perspectives and solutions cost-efficiently The OIBS reduces the work in generating ideas inside the companies Companies can find new, innovative employees via the OIBS Experienced senior employees and their knowledge is a valuable asset for companies and organizations. With OIBS the creativity and know-how of the retired can be utilized OIBS has an important technological and social role in commercializing new ideas and inventions

source: OIBS julkisille toimijoille (kaupungit, kunnat) Kaupungit/kunnat voivat kehittää palvelujaan OIBS:n kautta. Julkiset organisaatiot voivat järjestää ideointikilpailuja palvelujen parantamiseksi OIBS:n kautta asukkaat pääsevät kuntien kehitystyöhön konkreettisesti mukaan Laurean opiskelijoiden ehdotuksia OIBS:n hyödyistä Espoon kaupungille: http://www.oibs.fi/wiki/index.php/Laureas_example_1_Ryhma_13
en: OIBS for the public sector Cities or municipalities can develop their services with the help of the OIBS For instance, public organizations can hold an idea contest to find new ideas for improving services The citizens can participate in the development work of the municipality in a concrete way The suggestions made by Laurea students of the benefits of the OIBS for the city of Espoo http://www.oibs.fi/wiki/index.php/Laureas_example_1_Ryhma_13

source: OIBS muille (muut käyttäjät) OIBS on avoin palvelu kaikille innovaatioiden, ratkaisujen ja ideoiden luomisesta kiinnostuneille. Lisätietoja saat wikistä.
en: OIBS for other users OIBS is an open service for anyone interested in creating innovations, solutions and ideas You can find out more about the OIBS in OIBS wiki.

source: Hallintatyökalut
en: Admin tools
